-- MySQL dump 10.13  Distrib 8.0.41, for macos15 (x86_64)
--
-- Host: 127.0.0.1    Database: national_vehicle
-- ------------------------------------------------------
-- Server version	8.4.4

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `region_name`
--

DROP TABLE IF EXISTS `region_name`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `region_name` (
  `id` int NOT NULL AUTO_INCREMENT,
  `city_do` varchar(50) NOT NULL,
  `city_gun_gu` varchar(50) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `city_do` (`city_do`,`city_gun_gu`)
) ENGINE=InnoDB AUTO_INCREMENT=3524 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `region_name`
--

LOCK TABLES `region_name` WRITE;
/*!40000 ALTER TABLE `region_name` DISABLE KEYS */;
INSERT INTO `region_name` VALUES (238,'강원','강릉시'),(256,'강원','계'),(239,'강원','고성군'),(240,'강원','동해시'),(241,'강원','삼척시'),(242,'강원','속초시'),(243,'강원','양구군'),(244,'강원','양양군'),(245,'강원','영월군'),(246,'강원','원주시'),(247,'강원','인제군'),(248,'강원','정선군'),(249,'강원','철원군'),(250,'강원','춘천시'),(251,'강원','태백시'),(252,'강원','평창군'),(253,'강원','홍천군'),(254,'강원','화천군'),(255,'강원','횡성군'),(85,'경기','가평군'),(130,'경기','계'),(86,'경기','고양시 덕양구'),(87,'경기','고양시 일산동구'),(88,'경기','고양시 일산서구'),(89,'경기','과천시'),(90,'경기','광명시'),(91,'경기','광주시'),(92,'경기','구리시'),(93,'경기','군포시'),(94,'경기','김포시'),(95,'경기','남양주시'),(96,'경기','동두천시'),(97,'경기','부천시'),(98,'경기','부천시 소사구'),(99,'경기','부천시 오정구'),(100,'경기','부천시 원미구'),(101,'경기','성남시 분당구'),(102,'경기','성남시 수정구'),(103,'경기','성남시 중원구'),(104,'경기','수원시 권선구'),(105,'경기','수원시 영통구'),(106,'경기','수원시 장안구'),(107,'경기','수원시 팔달구'),(108,'경기','시흥시'),(109,'경기','안산시 단원구'),(110,'경기','안산시 상록구'),(111,'경기','안성시'),(112,'경기','안양시 동안구'),(113,'경기','안양시 만안구'),(114,'경기','양주시'),(115,'경기','양평군'),(116,'경기','여주시'),(117,'경기','연천군'),(118,'경기','오산시'),(119,'경기','용인시 기흥구'),(120,'경기','용인시 수지구'),(121,'경기','용인시 처인구'),(122,'경기','의왕시'),(123,'경기','의정부시'),(124,'경기','이천시'),(125,'경기','파주시'),(126,'경기','평택시'),(127,'경기','포천시'),(128,'경기','하남시'),(129,'경기','화성시'),(212,'경남','거제시'),(213,'경남','거창군'),(234,'경남','계'),(214,'경남','고성군'),(215,'경남','김해시'),(216,'경남','남해군'),(217,'경남','밀양시'),(218,'경남','사천시'),(219,'경남','산청군'),(220,'경남','양산시'),(221,'경남','의령군'),(222,'경남','진주시'),(223,'경남','창녕군'),(224,'경남','창원시 마산합포구'),(225,'경남','창원시 마산회원구'),(226,'경남','창원시 성산구'),(227,'경남','창원시 의창구'),(228,'경남','창원시 진해구'),(229,'경남','통영시'),(230,'경남','하동군'),(231,'경남','함안군'),(232,'경남','함양군'),(233,'경남','합천군'),(187,'경북','경산시'),(188,'경북','경주시'),(211,'경북','계'),(189,'경북','고령군'),(190,'경북','구미시'),(191,'경북','군위군'),(192,'경북','김천시'),(193,'경북','문경시'),(194,'경북','봉화군'),(195,'경북','상주시'),(196,'경북','성주군'),(197,'경북','안동시'),(198,'경북','영덕군'),(199,'경북','영양군'),(200,'경북','영주시'),(201,'경북','영천시'),(202,'경북','예천군'),(203,'경북','울릉군'),(204,'경북','울진군'),(205,'경북','의성군'),(206,'경북','청도군'),(207,'경북','청송군'),(208,'경북','칠곡군'),(209,'경북','포항시 남구'),(210,'경북','포항시 북구'),(70,'광주','계'),(65,'광주','광산구'),(66,'광주','남구'),(67,'광주','동구'),(68,'광주','북구'),(69,'광주','서구'),(53,'대구','계'),(44,'대구','군위군'),(45,'대구','남구'),(46,'대구','달서구'),(47,'대구','달성군'),(48,'대구','동구'),(49,'대구','북구'),(50,'대구','서구'),(51,'대구','수성구'),(52,'대구','중구'),(76,'대전','계'),(71,'대전','대덕구'),(72,'대전','동구'),(73,'대전','서구'),(74,'대전','유성구'),(75,'대전','중구'),(27,'부산','강서구'),(43,'부산','계'),(28,'부산','금정구'),(29,'부산','기장군'),(30,'부산','남구'),(31,'부산','동구'),(32,'부산','동래구'),(33,'부산','부산진구'),(34,'부산','북구'),(35,'부산','사상구'),(36,'부산','사하구'),(37,'부산','서구'),(38,'부산','수영구'),(39,'부산','연제구'),(40,'부산','영도구'),(41,'부산','중구'),(42,'부산','해운대구'),(1,'서울','강남구'),(2,'서울','강동구'),(3,'서울','강북구'),(4,'서울','강서구'),(26,'서울','계'),(5,'서울','관악구'),(6,'서울','광진구'),(7,'서울','구로구'),(8,'서울','금천구'),(9,'서울','노원구'),(10,'서울','도봉구'),(11,'서울','동대문구'),(12,'서울','동작구'),(13,'서울','마포구'),(14,'서울','서대문구'),(15,'서울','서초구'),(16,'서울','성동구'),(17,'서울','성북구'),(18,'서울','송파구'),(19,'서울','양천구'),(20,'서울','영등포구'),(21,'서울','용산구'),(22,'서울','은평구'),(23,'서울','종로구'),(24,'서울','중구'),(25,'서울','중랑구'),(84,'세종','계'),(83,'세종','세종특별자치시'),(82,'울산','계'),(77,'울산','남구'),(78,'울산','동구'),(79,'울산','북구'),(80,'울산','울주군'),(81,'울산','중구'),(54,'인천','강화군'),(64,'인천','계'),(55,'인천','계양구'),(56,'인천','남동구'),(57,'인천','동구'),(58,'인천','미추홀구'),(59,'인천','부평구'),(60,'인천','서구'),(61,'인천','연수구'),(62,'인천','옹진군'),(63,'인천','중구'),(164,'전남','강진군'),(186,'전남','계'),(165,'전남','고흥군'),(166,'전남','곡성군'),(167,'전남','광양시'),(168,'전남','구례군'),(169,'전남','나주시'),(170,'전남','담양군'),(171,'전남','목포시'),(172,'전남','무안군'),(173,'전남','보성군'),(174,'전남','순천시'),(175,'전남','신안군'),(176,'전남','여수시'),(177,'전남','영광군'),(178,'전남','영암군'),(179,'전남','완도군'),(180,'전남','장성군'),(181,'전남','장흥군'),(182,'전남','진도군'),(183,'전남','함평군'),(184,'전남','해남군'),(185,'전남','화순군'),(257,'전북','고창군'),(258,'전북','군산시'),(259,'전북','김제시'),(260,'전북','남원시'),(261,'전북','무주군'),(262,'전북','부안군'),(263,'전북','순창군'),(264,'전북','완주군'),(265,'전북','익산시'),(266,'전북','임실군'),(267,'전북','장수군'),(268,'전북','전주시 덕진구'),(269,'전북','전주시 완산구'),(270,'전북','정읍시'),(271,'전북','진안군'),(237,'제주','계'),(235,'제주','서귀포시'),(236,'제주','제주시'),(163,'충남','계'),(147,'충남','계룡시'),(148,'충남','공주시'),(149,'충남','금산군'),(150,'충남','논산시'),(151,'충남','당진시'),(152,'충남','보령시'),(153,'충남','부여군'),(154,'충남','서산시'),(155,'충남','서천군'),(156,'충남','아산시'),(157,'충남','예산군'),(158,'충남','천안시 동남구'),(159,'충남','천안시 서북구'),(160,'충남','청양군'),(161,'충남','태안군'),(162,'충남','홍성군'),(146,'충북','계'),(131,'충북','괴산군'),(132,'충북','단양군'),(133,'충북','보은군'),(134,'충북','영동군'),(135,'충북','옥천군'),(136,'충북','음성군'),(137,'충북','제천시'),(138,'충북','증평군'),(139,'충북','진천군'),(140,'충북','청원군'),(141,'충북','청주시 상당구'),(142,'충북','청주시 서원구'),(143,'충북','청주시 청원구'),(144,'충북','청주시 흥덕구'),(145,'충북','충주시');
/*!40000 ALTER TABLE `region_name` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-18 14:31:31
